一、
1.生理性动机
2.内在动机 外在动机
3.行为动机
4.主导动机 从属动机
5.主导动机
6.匮乏动机 成长动机
7.生理需求 安全需求 社交需求 尊重需求 自我需求
二、
1.德西效应：适度的奖励有利于巩固个体的内在动机，但过多的奖励却有可能降低个体对事情本身的兴趣．降低其内在动机。
2.成长动机：成长动机是被高级需要所驱使的动机,是指个体试图超过他以往成就的动机。在这种动机的驱使下,人们愿意承受不确定性、紧张乃至痛苦,以使自身的潜能得以实现。
三、
（1）激发功能，激发个体产生某种行为；
（2）指向功能，使个体的行为指向一定目标。
（3）维持和调节功能，使个体的行为维持一定的时间，并调行为的强度和方向。
四、
动机是引起和维持个体的活动，并使活动朝向某一目标的内在心理过程或内部动力。学习动机是激发个体进行学习活动、维持已引起的学习活动，并使行为朝向学习目标的一种内在过程或内部心理状态。
(1)动机强化理论的提出者是行为主义学习理论家斯金纳，他认为人的某种学习行为倾向完全取决于先前的这种学习行为与刺激因强化而建立起来的稳固联系，不断强化则可以使这种联结得到加强和巩固；任何学习行为都是为了获得某种报偿，受到强化的行为比没有受到强化的行为，重复率要高。但是该理论过分强调引起学习行为的外部力量，忽视甚至否定了人的学习行为的自觉性与主动性，具有较大的局限性。 
(2)个体动机的行为，一部分是先天性的，一部分是通过培养获得的。激发孩子长期坚持练习钢琴的兴趣可以有以下途径。 ①创设问题情境，实施启发式教学。把孩子带到情境中，使孩子在一个愉悦的氛围中练习钢琴，提供了良好的外部刺激和学习乐趣。 ②根据钢琴课业难度，恰当控制动机水平。要做到学习结果的反馈要及时、具体，并给予适当的短评以鼓舞孩子的信心。 ③充分利用反馈信息，妥善进行奖惩。肯定的评价具有积极的强化作用，能使孩子再接再厉，批评也能使孩子认识错误，避免再次犯错。 ④正确指导结果归因，促使孩子继续努力。通过结果的归因会对以后的学习行为产生影响。 只有针对不同的情况、不同的目标、不同的个体，综合运用各种方式，才能调动孩子学习的兴趣，提高学习的效果。
